Catalogs/АбонементыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АбонементыКлиента</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВидАбонемента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПокупки</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаДействия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Использовано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Заморожено</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПроданоПоДокументу</Name>
      <ValueType><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Catalogs/АбонементыКлиента/Ext/ObjectModule.bsl
// Модуль справочника Абонементы клиента

// Вычисление остатка занятий: Количество - Использовано
Функция ОстатокЗанятий() Экспорт
	Возврат КоличествоЗанятий - Использовано;
КонецФункции

Процедура ОбработкаЗаписи(Отказ)
	// Автоматический контроль статуса по остатку
	Если Не ПустоеЗначение(ДатаОкончания) И ДатаОкончания < ТекущаяДата() Тогда
		Если Статус <> Перечисления.СтатусыАбонементаКлиента.Заморожен Тогда
			Статус = Перечисления.СтатусыАбонементаКлиента.Истёк;
		КонецЕсли;
	ИначеЕсли Использовано >= КоличествоЗанятий Тогда
		Статус = Перечисления.СтатусыАбонементаКлиента.Закончился;
	КонецЕсли;
КонецПроцедуры
